eisup_2019_docmng_integration/src/AccumulationRegisters/СтраховыеВзносыИсчисленные/СтраховыеВзносыИсчисленные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтраховыеВзносыИсчисленные</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ПФРСтраховая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПФРСтраховаяЕНВД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПФРНакопительная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПФРНакопительнаяЕНВД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФСС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФФОМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТФОМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФССНесчастныеСлучаи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПФРПоДополнительномуТарифу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФССЕНВД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФФОМСЕНВД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТФОМСЕНВД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПФРНаДоплатуКПенсииШахтерам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/СведенияОбИнвалидностиФизлиц/СведенияОбИнвалидностиФизлиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОбИнвалидностиФизлиц</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Инвалидность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>СерияСправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИнвалидности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияСправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/РасчетыПоСтраховымВзносам/РасчетыПоСтраховымВзносам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыПоСтраховымВзносам</name>
  <resources>
    <name>ПФРСтраховая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПФРНакопительная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФСС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФФОМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТФОМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФССНесчастныеСлучаи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПФРПоДополнительномуТарифу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПФРНаДоплатуКПенсииШахтерам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <comment>Это может быть как головная организация, так и обособленное подразделение</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПлатежа</name>
    <type>
      <types>EnumRef.ВидыПлатежейВГосБюджет</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцРасчетногоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОблагаетсяЕНВД</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/ЗаписиОСтажеДляСЗВ4/ЗаписиОСтажеДляСЗВ4.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаписиОСтажеДляСЗВ4</name>
  <comment>(Регл)</comment>
  <resources>
    <name>ДатаНачалаПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсобыеУсловияТруда</name>
    <type>
      <types>CatalogRef.ОсобыеУсловияТруда</types>
    </type>
  </resources>
  <resources>
    <name>КодПозицииСписка</name>
    <type>
      <types>CatalogRef.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения</types>
    </type>
  </resources>
  <resources>
    <name>ОснованиеИсчисляемогоСтажа</name>
    <type>
      <types>CatalogRef.ОснованияИсчисляемогоТрудовогоСтажа</types>
    </type>
  </resources>
  <resources>
    <name>ПервыйПараметрИсчисляемогоСтажа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВторойПараметрИсчисляемогоСтажа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТретийПараметрИсчисляемогоСтажа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОснованиеВыслугиЛет</name>
    <type>
      <types>CatalogRef.ОснованияВыслугиЛет</types>
    </type>
  </resources>
  <resources>
    <name>ПервыйПараметрВыслугиЛет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВторойПараметрВыслугиЛет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТретийПараметрВыслугиЛет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТерриториальныеУсловия</name>
    <type>
      <types>CatalogRef.ТерриториальныеУсловия</types>
    </type>
  </resources>
  <resources>
    <name>ПараметрТерриториальныхУсловий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерОсновнойЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДополнительнойЗаписи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтчетныйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияЗастрахованныхЛиц</name>
    <type>
      <types>EnumRef.КатегорииЗастрахованныхЛицПФР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/ФИОФизЛиц/ФИОФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФИОФизЛиц</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Фамилия</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/ТарифыСтраховыхВзносов/ТарифыСтраховыхВзносов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТарифыСтраховыхВзносов</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>ОбщийНалоговыйРежим</name>
  </enumValues>
  <enumValues>
    <name>СельХозПроизводители</name>
  </enumValues>
  <enumValues>
    <name>УпрощенныйНалоговыйРежим</name>
  </enumValues>
  <enumValues>
    <name>ЕСХН</name>
  </enumValues>
  <enumValues>
    <name>ЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацияИнвалидов</name>
  </enumValues>
  <enumValues>
    <name>РезидентТехникоВнедренческойЗоны</name>
  </enumValues>
  <enumValues>
    <name>УчастникПроектаИнновационныйЦентрСколково</name>
  </enumValues>
  <enumValues>
    <name>ХозОбществаБюджетныхВУЗов</name>
  </enumValues>
  <enumValues>
    <name>ITОрганизации</name>
  </enumValues>
  <enumValues>
    <name>УпрощенныйНалоговыйРежимПроизводство</name>
  </enumValues>
  <enumValues>
    <name>СМИ</name>
  </enumValues>
  <enumValues>
    <name>НародныеХудожественныеПромыслы</name>
  </enumValues>
  <enumValues>
    <name>ДляЧленовЭкипажейМорскихСудовПодФлагомРФ</name>
  </enumValues>
  <enumValues>
    <name>ДляФармацевтовАптек</name>
  </enumValues>
  <enumValues>
    <name>НекоммерческиеОрганизации</name>
  </enumValues>
  <enumValues>
    <name>БлаготворительныеОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ОрганизацииОказывающиеИнжиниринговыеУслуги</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/КатегорииЗастрахованныхЛицПФР/КатегорииЗастрахованныхЛицПФР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииЗастрахованныхЛицПФР</name>
  <enumValues>
    <name>НР</name>
  </enumValues>
  <enumValues>
    <name>СХ</name>
  </enumValues>
  <enumValues>
    <name>ОЗОИ</name>
  </enumValues>
  <enumValues>
    <name>ЕСХН</name>
  </enumValues>
  <enumValues>
    <name>УСЕН</name>
  </enumValues>
  <enumValues>
    <name>ХМН</name>
  </enumValues>
  <enumValues>
    <name>ООИ</name>
  </enumValues>
  <enumValues>
    <name>ХО</name>
  </enumValues>
  <enumValues>
    <name>ТВЭЗ</name>
  </enumValues>
  <enumValues>
    <name>ОДИТ</name>
  </enumValues>
  <enumValues>
    <name>СМИ</name>
  </enumValues>
  <enumValues>
    <name>ПНЭД</name>
  </enumValues>
  <enumValues>
    <name>ИЦС</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/CommonModules/ПроцедурыПерсонифицированногоУчетаПолныеПрава/Module.bsl
Функция ВписатьКатегорииВДанныеСтажа(ОбособленноеПодразделение, ДатаНачалаПериодаЗаполнения, ДатаОкончанияПериодаЗаполнения, ТаблицаСтажа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ОтчетныйПериод",				ДатаНачалаПериодаЗаполнения);
	Запрос.УстановитьПараметр("Организация",				ОбособленноеПодразделение);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",		ОбщегоНазначения.ГоловнаяОрганизация(ОбособленноеПодразделение));
	Запрос.УстановитьПараметр("КонецОтчетногоПериода",		КонецМесяца(ДатаОкончанияПериодаЗаполнения));

	// конец месяца налогового периода
	КонецМесяца = КонецМесяца(ДатаНачалаПериодаЗаполнения);
	// первый месяц
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = Месяц(ДатаНачалаПериодаЗаполнения) По Месяц(ДатаОкончанияПериодаЗаполнения) Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаФизлиц.Физлицо,
	|	ТаблицаФизлиц.ОтчетныйПериод,
	|	ТаблицаФизлиц.ОбособленноеПодразделение,
	|	ТаблицаФизлиц.ДатаНачалаПериода,
	|	ТаблицаФизлиц.ДатаОкончанияПериода,
	|	ТаблицаФизлиц.ТерриториальныеУсловия,
	|	ТаблицаФизлиц.ОсобыеУсловияТруда,
	|	ТаблицаФизлиц.КодПозицииСписка,
	|	ТаблицаФизлиц.ТретийПараметрИсчисляемогоСтажа,
	|	ТаблицаФизлиц.ТретийПараметрВыслугиЛет,
	|	ТаблицаФизлиц.ПараметрТерриториальныхУсловий,
	|	ТаблицаФизлиц.ОснованиеВыслугиЛет
	|ПОМЕСТИТЬ ВТТаблицаСтажа
	|ИЗ
	|	&ТаблицаФизлиц КАК ТаблицаФизлиц";
	Запрос.УстановитьПараметр("ТаблицаФизлиц", ТаблицаСтажа);
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим) КАК ВидТарифаСтраховыхВзносов,
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.НР) КАК КатегорияЗастрахованныхЛиц
	|ПОМЕСТИТЬ ВТСоответствиеТарифаКатегории
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.НР)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.СельХозПроизводители),
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.СХ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим),
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.УСЕН)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕСХН),
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ЕСХН)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД),
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.УСЕН)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов),
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ОЗОИ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.РезидентТехникоВнедренческойЗоны),
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ОЗОИ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСтажа.Физлицо КАК Физлицо,
	|	ТаблицаСтажа.ОтчетныйПериод,
	|	ТаблицаСтажа.ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА ТаблицаСтажа.ДатаНачалаПериода < НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ)
	|			ТОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ)
	|		ИНАЧЕ ТаблицаСтажа.ДатаНачалаПериода
	|	КОНЕЦ КАК ДатаНачалаПериода,
	|	ВЫБОР
	|		КОГДА ТаблицаСтажа.ДатаОкончанияПериода < Периоды.Период
	|			ТОГДА ТаблицаСтажа.ДатаОкончанияПериода
	|		ИНАЧЕ Периоды.Период
	|	КОНЕЦ КАК ДатаОкончанияПериода,
	|	ТаблицаСтажа.ТерриториальныеУсловия,
	|	ТаблицаСтажа.ОсобыеУсловияТруда,
	|	ТаблицаСтажа.КодПозицииСписка,
	|	ТаблицаСтажа.ТретийПараметрИсчисляемогоСтажа,
	|	ТаблицаСтажа.ТретийПараметрВыслугиЛет,
	|	ТаблицаСтажа.ПараметрТерриториальныхУсловий,
	|	ТаблицаСтажа.ОснованиеВыслугиЛет,
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК МесяцОтчетногоПериода,
	|	Периоды.Период
	|ПОМЕСТИТЬ ВТФизЛица
	|ИЗ
	|	ВТТаблицаСтажа КАК ТаблицаСтажа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериоды КАК Периоды
	|		ПО (Периоды.Период МЕЖДУ НАЧАЛОПЕРИОДА(ТаблицаСтажа.ДатаНачалаПериода, МЕСЯЦ) И КОНЕЦПЕРИОДА(ТаблицаСтажа.ДатаОкончанияПериода, МЕСЯЦ))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыИсчисленныеОбороты.ФизЛицо КАК ФизЛицо,
	|	СтраховыеВзносыИсчисленныеОбороты.Период КАК МесяцОтчетногоПериода,
	|	КОНЕЦПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.Период, МЕСЯЦ) КАК Период,
	|	СтраховыеВзносыИсчисленныеОбороты.ПФРСтраховаяОборот КАК ПФРСтраховаяОборот,
	|	СтраховыеВзносыИсчисленныеОбороты.ПФРНакопительнаяОборот КАК ПФРНакопительнаяОборот,
	|	СтраховыеВзносыИсчисленныеОбороты.ПФРСтраховаяЕНВДОборот,
	|	СтраховыеВзносыИсчисленныеОбороты.ПФРНакопительнаяЕНВДОборот
	|ПОМЕСТИТЬ ВТИсчисленоПоЗЛ
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные.Обороты(
	|			&ОтчетныйПериод,
	|			&КонецОтчетногоПериода,
	|			Месяц,
	|			ОбособленноеПодразделение = &Организация
	|				И ФизЛицо В
	|					(ВЫБРАТЬ
	|						ФизЛица.Физлицо
	|					ИЗ
	|						ВТФизЛица КАК ФизЛица)) КАК СтраховыеВзносыИсчисленныеОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.ПериодРегистрации КАК МесяцОтчетногоПериода,
	|	СрезПоследнихДат.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТИнвалиды
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК Период
	|	ИЗ
	|		ВТФизЛица КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
	|	ГДЕ
	|		СведенияОбИнвалидностиФизлиц.Физлицо В
	|				(ВЫБРАТЬ
	|					Физлица.Физлицо
	|				ИЗ
	|					ВТФизЛица КАК Физлица)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОбИнвалидностиФизлиц.Физлицо,
	|		Периоды.Период) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|		ПО СрезПоследнихДат.Период = СведенияОбИнвалидностиФизлиц.Период
	|			И СрезПоследнихДат.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|ГДЕ
	|	СведенияОбИнвалидностиФизлиц.Инвалидность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК МесяцОтчетногоПериода,
	|	ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТВидыТарифныхСтавокОрганизаций
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация КАК Организация,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &ГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И Периоды.Организация = УчетнаяПолитикаНалоговыйУчет.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Исчислено.ФизЛицо КАК ФизЛицо,
	|	Исчислено.КатегорияЗастрахованныхЛиц,
	|	Исчислено.МесяцОтчетногоПериода
	|ПОМЕСТИТЬ ВТИсчисленоПоКатегориямЗЛ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИсчисленоПоЗЛ.ФизЛицо КАК ФизЛицо,
	|		ИсчисленоПоЗЛ.ПФРНакопительнаяОборот КАК ПФРНакопительнаяОборот,
	|		ИсчисленоПоЗЛ.ПФРСтраховаяОборот КАК ПФРСтраховаяОборот,
	|		СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|		ИсчисленоПоЗЛ.МесяцОтчетногоПериода КАК МесяцОтчетногоПериода
	|	ИЗ
	|		ВТИсчисленоПоЗЛ КАК ИсчисленоПоЗЛ
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавокОрганизаций
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|				ПО ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|			ПО ИсчисленоПоЗЛ.МесяцОтчетногоПериода = ВидыТарифныхСтавокОрганизаций.МесяцОтчетногоПериода
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ИсчисленоПоЗЛ.ФизЛицо,
	|		ИсчисленоПоЗЛ.ПФРНакопительнаяЕНВДОборот,
	|		ИсчисленоПоЗЛ.ПФРСтраховаяЕНВДОборот,
	|		ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.УСЕН),
	|		ИсчисленоПоЗЛ.МесяцОтчетногоПериода
	|	ИЗ
	|		ВТИсчисленоПоЗЛ КАК ИсчисленоПоЗЛ) КАК Исчислено
	|
	|СГРУППИРОВАТЬ ПО
	|	Исчислено.ФизЛицо,
	|	Исчислено.КатегорияЗастрахованныхЛиц,
	|	Исчислено.МесяцОтчетногоПериода
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Исчислено.ПФРНакопительнаяОборот) <> 0
	|		ИЛИ СУММА(Исчислено.ПФРСтраховаяОборот) <> 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаФизлиц.Физлицо КАК ФизЛицо,
	|	ТаблицаФизлиц.ОтчетныйПериод,
	|	ТаблицаФизлиц.ОбособленноеПодразделение,
	|	ТаблицаФизлиц.ДатаНачалаПериода КАК ДатаНачалаПериода,
	|	ТаблицаФизлиц.ДатаОкончанияПериода,
	|	ТаблицаФизлиц.ТерриториальныеУсловия,
	|	ТаблицаФизлиц.ОсобыеУсловияТруда,
	|	ТаблицаФизлиц.КодПозицииСписка,
	|	ТаблицаФизлиц.ТретийПараметрИсчисляемогоСтажа,
	|	ТаблицаФизлиц.ПараметрТерриториальныхУсловий,
	|	ТаблицаФизлиц.ОснованиеВыслугиЛет,
	|	ТаблицаФизлиц.ТретийПараметрВыслугиЛет,
	|	ВЫБОР
	|		КОГДА Инвалиды.Физлицо ЕСТЬ НЕ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ОЗОИ)
	|		ИНАЧЕ ЕСТЬNULL(ИсчисленоПоЗЛ.КатегорияЗастрахованныхЛиц, ЕСТЬNULL(СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц, ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ПустаяСсылка)))
	|	КОНЕЦ КАК КатегорияЗастрахованныхЛиц
	|ИЗ
	|	ВТФизЛица КАК ТаблицаФизлиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
	|		ПО ТаблицаФизлиц.Физлицо = Инвалиды.Физлицо
	|			И ТаблицаФизлиц.МесяцОтчетногоПериода = Инвалиды.МесяцОтчетногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленоПоКатегориямЗЛ КАК ИсчисленоПоЗЛ
	|		ПО ТаблицаФизлиц.Физлицо = ИсчисленоПоЗЛ.ФизЛицо
	|			И ТаблицаФизлиц.МесяцОтчетногоПериода = ИсчисленоПоЗЛ.МесяцОтчетногоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавокОрганизаций
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|			ПО ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
	|		ПО ТаблицаФизлиц.МесяцОтчетногоПериода = ВидыТарифныхСтавокОрганизаций.МесяцОтчетногоПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо,
	|	КатегорияЗастрахованныхЛиц,
	|	ДатаНачалаПериода";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики());

	РезультатЗапроса = Запрос.Выполнить();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ДанныеОВзносахПоКатегориям(ДатаАктуальности, ПервыйОтчетныйПериод, ПоследнийОтчетныйПериод, Организация, МассивФизлиц = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
	Запрос.УстановитьПараметр("ДатаЗаменыЕСН", ПроведениеРасчетов.ДатаЗаменыЕСНСтраховымиВзносами());
	Запрос.УстановитьПараметр("ОтчетныйПериод", ПервыйОтчетныйПериод);
	Запрос.УстановитьПараметр("КонецОтчетногоПериода", ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ПоследнийОтчетныйПериод));
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("КонецПериодаУплаты", Мин(ДатаАктуальности, ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ПоследнийОтчетныйПериод)));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("НеОтбиратьФизлиц", Не ЗначениеЗаполнено(МассивФизлиц));
	Если МассивФизлиц = Неопределено Тогда
		МассивФизлиц = Новый Массив;
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивФизлиц", МассивФизлиц);
	
	// первый отчетный период
	ОчереднойОтчетныйПериод = ПервыйОтчетныйПериод;
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(ОчереднойОтчетныйПериод,"ДФ=гггг,М,д,Ч,м,с") + ") КАК ОтчетныйПериодФормирования ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Пока ОчереднойОтчетныйПериод < ПоследнийОтчетныйПериод Цикл
		ОчереднойОтчетныйПериод = ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ОчереднойОтчетныйПериод) + 1;
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(ОчереднойОтчетныйПериод,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(РасчетыПоСтраховымВзносамОбороты.ПФРСтраховаяРасход) КАК ПФРСтраховаяРасход,
	|	СУММА(РасчетыПоСтраховымВзносамОбороты.ПФРНакопительнаяРасход) КАК ПФРНакопительнаяРасход,
	|	ВЫБОР
	|		КОГДА РасчетыПоСтраховымВзносамОбороты.МесяцРасчетногоПериода < ДАТАВРЕМЯ(2010, 7, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2010, 1, 1, 0, 0, 0)
	|		КОГДА РасчетыПоСтраховымВзносамОбороты.МесяцРасчетногоПериода < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2010, 7, 1, 0, 0, 0)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(РасчетыПоСтраховымВзносамОбороты.МесяцРасчетногоПериода, КВАРТАЛ)
	|	КОНЕЦ КАК ОтчетныйПериод,
	|	ВЫБОР
	|		КОГДА РасчетыПоСтраховымВзносамОбороты.Период < ДАТАВРЕМЯ(2010, 7, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2010, 1, 1, 0, 0, 0)
	|		КОГДА РасчетыПоСтраховымВзносамОбороты.Период < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2010, 7, 1, 0, 0, 0)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(РасчетыПоСтраховымВзносамОбороты.Период, КВАРТАЛ)
	|	КОНЕЦ КАК ОтчетныйПериодФормирования
	|ПОМЕСТИТЬ ВТВсегоУплачено
	|ИЗ
	|	РегистрНакопления.РасчетыПоСтраховымВзносам.Обороты(
	|			&ОтчетныйПериод,
	|			&КонецПериодаУплаты,
	|			Месяц,
	|			ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог)
	|				И МесяцРасчетногоПериода >= &ДатаЗаменыЕСН
	|				И Организация = &Организация) КАК РасчетыПоСтраховымВзносамОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА РасчетыПоСтраховымВзносамОбороты.МесяцРасчетногоПериода < ДАТАВРЕМЯ(2010, 7, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2010, 1, 1, 0, 0, 0)
	|		КОГДА РасчетыПоСтраховымВзносамОбороты.МесяцРасчетногоПериода < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2010, 7, 1, 0, 0, 0)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(РасчетыПоСтраховымВзносамОбороты.МесяцРасчетногоПериода, КВАРТАЛ)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасчетыПоСтраховымВзносамОбороты.Период < ДАТАВРЕМЯ(2010, 7, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2010, 1, 1, 0, 0, 0)
	|		КОГДА РасчетыПоСтраховымВзносамОбороты.Период < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2010, 7, 1, 0, 0, 0)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(РасчетыПоСтраховымВзносамОбороты.Период, КВАРТАЛ)
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОтчетныйПериод";
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(ВсегоУплачено.ОтчетныйПериод) КАК НачалоРасчетногоПериода
	|ИЗ
	|	ВТВсегоУплачено КАК ВсегоУплачено";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() и ЗначениеЗаполнено(Выборка.НачалоРасчетногоПериода) Тогда
		Запрос.УстановитьПараметр("НачалоПериодаУплаты", ?(Выборка.НачалоРасчетногоПериода > ПервыйОтчетныйПериод, ПервыйОтчетныйПериод, Выборка.НачалоРасчетногоПериода));
	Иначе	
		Запрос.УстановитьПараметр("НачалоПериодаУплаты", ПервыйОтчетныйПериод);
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка КАК ФизЛицо
	|ПОМЕСТИТЬ ВТФизЛица
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Ссылка В(&МассивФизлиц)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим) КАК ВидТарифаСтраховыхВзносов,
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.НР) КАК КатегорияЗастрахованныхЛиц
	|ПОМЕСТИТЬ ВТСоответствиеТарифаКатегории
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.СельХозПроизводители),
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.СХ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.УпрощенныйНалоговыйРежим),
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.УСЕН)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕСХН),
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ЕСХН)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД),
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.УСЕН)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов),
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ОЗОИ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.РезидентТехникоВнедренческойЗоны),
	|	ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ОЗОИ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидТарифаСтраховыхВзносов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтраховыеВзносыИсчисленныеОбороты.ФизЛицо КАК ФизЛицо,
	|	СтраховыеВзносыИсчисленныеОбороты.Период КАК МесяцОтчетногоПериода,
	|	ВЫБОР
	|		КОГДА СтраховыеВзносыИсчисленныеОбороты.Период < ДАТАВРЕМЯ(2010, 7, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2010, 1, 1, 0, 0, 0)
	|		КОГДА СтраховыеВзносыИсчисленныеОбороты.Период < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2010, 7, 1, 0, 0, 0)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.Период, КВАРТАЛ)
	|	КОНЕЦ КАК ОтчетныйПериод,
	|	КОНЕЦПЕРИОДА(СтраховыеВзносыИсчисленныеОбороты.Период, МЕСЯЦ) КАК Период,
	|	СтраховыеВзносыИсчисленныеОбороты.ПФРСтраховаяОборот КАК ПФРСтраховаяОборот,
	|	СтраховыеВзносыИсчисленныеОбороты.ПФРНакопительнаяОборот КАК ПФРНакопительнаяОборот,
	|	СтраховыеВзносыИсчисленныеОбороты.ПФРСтраховаяЕНВДОборот,
	|	СтраховыеВзносыИсчисленныеОбороты.ПФРНакопительнаяЕНВДОборот
	|ПОМЕСТИТЬ ВТИсчисленоПоЗЛ
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыИсчисленные.Обороты(
	|			&НачалоПериодаУплаты,
	|			&КонецОтчетногоПериода,
	|			Месяц,
	|			ОбособленноеПодразделение = &Организация
	|				И (&НеОтбиратьФизлиц
	|					ИЛИ ФизЛицо В
	|						(ВЫБРАТЬ
	|							ФизЛица.ФизЛицо
	|						ИЗ
	|							ВТФизЛица КАК ФизЛица))) КАК СтраховыеВзносыИсчисленныеОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СрезПоследнихДат.ПериодРегистрации КАК МесяцОтчетногоПериода,
	|	СрезПоследнихДат.Физлицо КАК Физлицо
	|ПОМЕСТИТЬ ВТИнвалиды
	|ИЗ
	|	(ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК ПериодРегистрации,
	|		Периоды.ФизЛицо КАК Физлицо,
	|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК Период
	|	ИЗ
	|		ВТИсчисленоПоЗЛ КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|			ПО Периоды.Период >= СведенияОбИнвалидностиФизлиц.Период
	|				И Периоды.ФизЛицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.ФизЛицо,
	|		Периоды.Период) КАК СрезПоследнихДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
	|		ПО СрезПоследнихДат.Период = СведенияОбИнвалидностиФизлиц.Период
	|			И СрезПоследнихДат.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
	|ГДЕ
	|	СведенияОбИнвалидностиФизлиц.Инвалидность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК МесяцОтчетногоПериода,
	|	ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) КАК ВидТарифаСтраховыхВзносов
	|ПОМЕСТИТЬ ВТВидыТарифныхСтавокОрганизаций
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Период КАК Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация КАК Организация,
	|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
	|	ИЗ
	|		ВТИсчисленоПоЗЛ КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|			ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
	|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &ГоловнаяОрганизация)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Период,
	|		УчетнаяПолитикаНалоговыйУчет.Организация) КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
	|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
	|			И Периоды.Организация = УчетнаяПолитикаНалоговыйУчет.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	МесяцОтчетногоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(РасчетыПоСтраховымВзносамОбороты.ПФРСтраховаяПриход) КАК ПФРСтраховаяПриход,
	|	СУММА(РасчетыПоСтраховымВзносамОбороты.ПФРНакопительнаяПриход) КАК ПФРНакопительнаяПриход,
	|	ВЫБОР
	|		КОГДА РасчетыПоСтраховымВзносамОбороты.МесяцРасчетногоПериода < ДАТАВРЕМЯ(2010, 7, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2010, 1, 1, 0, 0, 0)
	|		КОГДА РасчетыПоСтраховымВзносамОбороты.МесяцРасчетногоПериода < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2010, 7, 1, 0, 0, 0)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(РасчетыПоСтраховымВзносамОбороты.МесяцРасчетногоПериода, КВАРТАЛ)
	|	КОНЕЦ КАК ОтчетныйПериод
	|ПОМЕСТИТЬ ВТВсегоНачислено
	|ИЗ
	|	РегистрНакопления.РасчетыПоСтраховымВзносам.Обороты(
	|			,
	|			&ДатаАктуальности,
	|			,
	|			ВидПлатежа = ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.Налог)
	|				И Организация = &Организация
	|				И МесяцРасчетногоПериода В
	|					(ВЫБРАТЬ
	|						Уплачено.МесяцОтчетногоПериода
	|					ИЗ
	|						ВТИсчисленоПоЗЛ КАК Уплачено)) КАК РасчетыПоСтраховымВзносамОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА РасчетыПоСтраховымВзносамОбороты.МесяцРасчетногоПериода < ДАТАВРЕМЯ(2010, 7, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2010, 1, 1, 0, 0, 0)
	|		КОГДА РасчетыПоСтраховымВзносамОбороты.МесяцРасчетногоПериода < ДАТАВРЕМЯ(2011, 1, 1, 0, 0, 0)
	|			ТОГДА ДАТАВРЕМЯ(2010, 7, 1, 0, 0, 0)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(РасчетыПоСтраховымВзносамОбороты.МесяцРасчетногоПериода, КВАРТАЛ)
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОтчетныйПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Исчислено.ФизЛицо КАК ФизЛицо,
	|	Исчислено.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|	Исчислено.ОтчетныйПериод,
	|	СУММА(Исчислено.ПФРНакопительнаяОборот) КАК ПФРНакопительнаяОборот,
	|	СУММА(Исчислено.ПФРСтраховаяОборот) КАК ПФРСтраховаяОборот
	|ПОМЕСТИТЬ ВТИсчисленоПоКатегориямЗЛ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИсчисленоПоЗЛ.ФизЛицо КАК ФизЛицо,
	|		ИсчисленоПоЗЛ.ПФРНакопительнаяОборот КАК ПФРНакопительнаяОборот,
	|		ИсчисленоПоЗЛ.ПФРСтраховаяОборот КАК ПФРСтраховаяОборот,
	|		СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|		ИсчисленоПоЗЛ.ОтчетныйПериод КАК ОтчетныйПериод
	|	ИЗ
	|		ВТИсчисленоПоЗЛ КАК ИсчисленоПоЗЛ
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
	|			ПО ИсчисленоПоЗЛ.ФизЛицо = Инвалиды.Физлицо
	|				И ИсчисленоПоЗЛ.МесяцОтчетногоПериода = Инвалиды.МесяцОтчетногоПериода
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыТарифныхСтавокОрганизаций КАК ВидыТарифныхСтавокОрганизаций
	|			ПО ИсчисленоПоЗЛ.МесяцОтчетногоПериода = ВидыТарифныхСтавокОрганизаций.МесяцОтчетногоПериода
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
	|			ПО (ВЫБОР
	|					КОГДА Инвалиды.Физлицо ЕСТЬ НЕ NULL 
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
	|					ИНАЧЕ ВидыТарифныхСтавокОрганизаций.ВидТарифаСтраховыхВзносов
	|				КОНЕЦ = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ИсчисленоПоЗЛ.ФизЛицо,
	|		ИсчисленоПоЗЛ.ПФРНакопительнаяЕНВДОборот,
	|		ИсчисленоПоЗЛ.ПФРСтраховаяЕНВДОборот,
	|		ВЫБОР
	|			КОГДА Инвалиды.Физлицо ЕСТЬ НЕ NULL 
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.ОЗОИ)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.КатегорииЗастрахованныхЛицПФР.УСЕН)
	|		КОНЕЦ,
	|		ИсчисленоПоЗЛ.ОтчетныйПериод
	|	ИЗ
	|		ВТИсчисленоПоЗЛ КАК ИсчисленоПоЗЛ
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
	|			ПО ИсчисленоПоЗЛ.ФизЛицо = Инвалиды.Физлицо
	|				И ИсчисленоПоЗЛ.МесяцОтчетногоПериода = Инвалиды.МесяцОтчетногоПериода) КАК Исчислено
	|
	|СГРУППИРОВАТЬ ПО
	|	Исчислено.ФизЛицо,
	|	Исчислено.КатегорияЗастрахованныхЛиц,
	|	Исчислено.ОтчетныйПериод
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	КатегорияЗастрахованныхЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.ОтчетныйПериодФормирования КАК ОтчетныйПериодФормирования,
	|	ВсегоУплачено.ОтчетныйПериод КАК ОтчетныйПериод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0) / ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0) > 1
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ВсегоУплачено.ПФРНакопительнаяРасход, 0) / ЕСТЬNULL(ВсегоНачислено.ПФРНакопительнаяПриход, 0)
	|	КОНЕЦ КАК КоэффициентУплатыНакопительная,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0) = 0
	|			ТОГДА 0
	|		КОГДА ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0) / ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0) > 1
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ВсегоУплачено.ПФРСтраховаяРасход, 0) / ЕСТЬNULL(ВсегоНачислено.ПФРСтраховаяПриход, 0)
	|	КОНЕЦ КАК КоэффициентУплатыСтраховая
	|ПОМЕСТИТЬ ВТКоэффициентыУплаты
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВсегоУплачено КАК ВсегоУплачено
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТВсегоНачислено КАК ВсегоНачислено
	|			ПО ВсегоУплачено.ОтчетныйПериод = ВсегоНачислено.ОтчетныйПериод
	|		ПО Периоды.ОтчетныйПериодФормирования = ВсегоУплачено.ОтчетныйПериодФормирования
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОтчетныйПериодФормирования,
	|	ОтчетныйПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыВзносов.ОтчетныйПериодФормирования КАК ОтчетныйПериод,
	|	СуммыВзносов.ФизЛицо КАК ФизЛицо,
	|	СуммыВзносов.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|	СУММА(СуммыВзносов.НачисленоНакопительная) КАК НачисленоНакопительная,
	|	СУММА(СуммыВзносов.НачисленоСтраховая) КАК НачисленоСтраховая,
	|	СУММА(СуммыВзносов.УплаченоСтраховая) КАК УплаченоСтраховая,
	|	СУММА(СуммыВзносов.УплаченоНакопительная) КАК УплаченоНакопительная
	|ИЗ
	|	(ВЫБРАТЬ
	|		ИсчисленоЗаПериодФормирования.ОтчетныйПериод КАК ОтчетныйПериодФормирования,
	|		ИсчисленоЗаПериодФормирования.ФизЛицо КАК ФизЛицо,
	|		ИсчисленоЗаПериодФормирования.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|		ИсчисленоЗаПериодФормирования.ПФРНакопительнаяОборот КАК НачисленоНакопительная,
	|		ИсчисленоЗаПериодФормирования.ПФРСтраховаяОборот КАК НачисленоСтраховая,
	|		0 КАК УплаченоСтраховая,
	|		0 КАК УплаченоНакопительная
	|	ИЗ
	|		ВТИсчисленоПоКатегориямЗЛ КАК ИсчисленоЗаПериодФормирования
	|	ГДЕ
	|		ИсчисленоЗаПериодФормирования.ОтчетныйПериод МЕЖДУ &ОтчетныйПериод И &КонецОтчетногоПериода
	|		И (ИсчисленоЗаПериодФормирования.ПФРНакопительнаяОборот <> 0
	|				ИЛИ ИсчисленоЗаПериодФормирования.ПФРСтраховаяОборот <> 0)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КоэффициентыУплаты.ОтчетныйПериодФормирования,
	|		ИсчисленоПоКатегориямЗЛ.ФизЛицо,
	|		ИсчисленоПоКатегориямЗЛ.КатегорияЗастрахованныхЛиц,
	|		0,
	|		0,
	|		ИсчисленоПоКатегориямЗЛ.ПФРСтраховаяОборот * КоэффициентыУплаты.КоэффициентУплатыСтраховая,
	|		ИсчисленоПоКатегориямЗЛ.ПФРНакопительнаяОборот * КоэффициентыУплаты.КоэффициентУплатыНакопительная
	|	ИЗ
	|		ВТКоэффициентыУплаты КАК КоэффициентыУплаты
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТИсчисленоПоКатегориямЗЛ КАК ИсчисленоПоКатегориямЗЛ
	|			ПО КоэффициентыУплаты.ОтчетныйПериод = ИсчисленоПоКатегориямЗЛ.ОтчетныйПериод
	|	ГДЕ
	|		ИсчисленоПоКатегориямЗЛ.ФизЛицо ЕСТЬ НЕ NULL 
	|		И (ИсчисленоПоКатегориямЗЛ.ПФРНакопительнаяОборот <> 0
	|				ИЛИ ИсчисленоПоКатегориямЗЛ.ПФРСтраховаяОборот <> 0)
	|		И (КоэффициентыУплаты.КоэффициентУплатыНакопительная <> 0
	|				ИЛИ КоэффициентыУплаты.КоэффициентУплатыСтраховая <> 0)) КАК СуммыВзносов
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммыВзносов.ОтчетныйПериодФормирования,
	|	СуммыВзносов.ФизЛицо,
	|	СуммыВзносов.КатегорияЗастрахованныхЛиц
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо,
	|	КатегорияЗастрахованныхЛиц,
	|	ОтчетныйПериодФормирования";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики());
	
	РезультатЗапроса = Запрос.Выполнить();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции // ДанныеОВзносахПоКатегориям()

Функция ДанныеОСтажеИВзносах(ДатаАктуальности, ОтчетныйПериод, Организация, МассивФизлиц = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
	Запрос.УстановитьПараметр("ОтчетныйПериод", ОтчетныйПериод);
	Запрос.УстановитьПараметр("КонецОтчетногоПериода", ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ОтчетныйПериод));
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НеОтбиратьФизлиц", Не ЗначениеЗаполнено(МассивФизлиц));
	Если МассивФизлиц = Неопределено Тогда
		МассивФизлиц = Новый Массив;
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивФизлиц", МассивФизлиц);
	
	Запрос.УстановитьПараметр("ТаблицаВзносов",	ДанныеОВзносахПоКатегориям(ДатаАктуальности, ОтчетныйПериод, ОтчетныйПериод, Организация, МассивФизлиц));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СуммыВзносов.ФизЛицо КАК ФизЛицо,
	|	СуммыВзносов.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|	СуммыВзносов.НачисленоНакопительная,
	|	СуммыВзносов.НачисленоСтраховая,
	|	СуммыВзносов.УплаченоСтраховая,
	|	СуммыВзносов.УплаченоНакопительная
	|ПОМЕСТИТЬ ВТСуммыВзносов
	|ИЗ
	|	&ТаблицаВзносов КАК СуммыВзносов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	КатегорияЗастрахованныхЛиц";
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаписиОСтаже.ФизЛицо КАК ФизЛицо,
	|	ЗаписиОСтаже.ТерриториальныеУсловия КАК ТерриториальныеУсловия,
	|	ЗаписиОСтаже.ТретийПараметрИсчисляемогоСтажа,
	|	ЗаписиОСтаже.ОсобыеУсловияТруда,
	|	ЗаписиОСтаже.КодПозицииСписка,
	|	ЗаписиОСтаже.ОснованиеИсчисляемогоСтажа,
	|	ЗаписиОСтаже.ОснованиеВыслугиЛет,
	|	ЗаписиОСтаже.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|	ЗаписиОСтаже.ФизЛицо.СтраховойНомерПФР КАК СтраховойНомерПФР,
	|	ЗаписиОСтаже.ФизЛицо.Наименование КАК Наименование
	|ПОМЕСТИТЬ ВТФизЛица
	|ИЗ
	|	РегистрСведений.ЗаписиОСтажеДляСЗВ4 КАК ЗаписиОСтаже
	|ГДЕ
	|	ЗаписиОСтаже.ОтчетныйПериод = &ОтчетныйПериод
	|	И ЗаписиОСтаже.ОбособленноеПодразделение = &Организация
	|	И (&НеОтбиратьФизлиц
	|			ИЛИ ЗаписиОСтаже.ФизЛицо В (&МассивФизлиц))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	КатегорияЗастрахованныхЛиц";
	Запрос.Выполнить();
	
	// адреса для информирования заполняем только в том случае, когда они изменились по сравнению с последними
	// передававшимися в ПФР
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФИОФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество
	|ПОМЕСТИТЬ ВТФИО
	|ИЗ
	|	РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|			&ДатаАктуальности,
	|			ФизЛицо В
	|				(ВЫБРАТЬ
	|					Лица.ФизЛицо КАК ФизЛицо
	|				ИЗ
	|					ВТФизЛица КАК Лица)) КАК ФИОФизЛицСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаписиОСтаже.ФизЛицо КАК ФизЛицо,
	|	ЗаписиОСтаже.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЗаписиОСтаже.ОсобыеУсловияТруда <> ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТруда.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЛьготыПоУсловиямТруда,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЗаписиОСтаже.ОсобыеУсловияТруда = ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТруда.ПустаяСсылка)
	|					И (ЗаписиОСтаже.ОснованиеВыслугиЛет <> ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.ПустаяСсылка)
	|						ИЛИ ЗаписиОСтаже.ОснованиеИсчисляемогоСтажа <> ЗНАЧЕНИЕ(Справочник.ОснованияИсчисляемогоТрудовогоСтажа.ПустаяСсылка))
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЛьготыПоВыслуге
	|ПОМЕСТИТЬ ВТФизЛицаСЗВ61
	|ИЗ
	|	ВТФизЛица КАК ЗаписиОСтаже
	|ГДЕ
	|	(ЗаписиОСтаже.ОсобыеУсловияТруда <> ЗНАЧЕНИЕ(Справочник.ОсобыеУсловияТруда.ПустаяСсылка)
	|			ИЛИ ЗаписиОСтаже.ТерриториальныеУсловия <> ЗНАЧЕНИЕ(Справочник.ТерриториальныеУсловия.ПустаяСсылка)
	|			ИЛИ ЗаписиОСтаже.ОснованиеВыслугиЛет <> ЗНАЧЕНИЕ(Справочник.ОснованияВыслугиЛет.ПустаяСсылка)
	|			ИЛИ ЗаписиОСтаже.ОснованиеИсчисляемогоСтажа <> ЗНАЧЕНИЕ(Справочник.ОснованияИсчисляемогоТрудовогоСтажа.ПустаяСсылка)
	|			ИЛИ ЗаписиОСтаже.ТретийПараметрИсчисляемогоСтажа <> """")
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаписиОСтаже.КатегорияЗастрахованныхЛиц,
	|	ЗаписиОСтаже.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаписиОСтаже.ОсобыеУсловияТруда) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо КАК ФизЛицо,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.Дата,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.АдресДляИнформирования
	|ПОМЕСТИТЬ ВТПереданныеВПФРДокументы
	|ИЗ
	|	Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4.РаботникиОрганизации КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
	|ГДЕ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.АдресДляИнформирования <> """"
	|	И СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.Организация = &Организация
	|	И СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.Проведен
	|	И СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.ПринятоВПФР
	|	И СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.Дата <= &ДатаАктуальности
	|	И СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо В
	|			(ВЫБРАТЬ
	|				ФизЛица.ФизЛицо
	|			ИЗ
	|				ВТФизЛица КАК ФизЛица)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыДокументов.ФизЛицо КАК ФизЛицо,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.АдресДляИнформирования КАК АдресДляИнформирования
	|ПОМЕСТИТЬ ВТПереданныеВПФРАдреса
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Дата) КАК Дата,
	|		СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо КАК ФизЛицо
	|	ИЗ
	|		ВТПереданныеВПФРДокументы КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо) КАК ДатыДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПереданныеВПФРДокументы КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации
	|		ПО ДатыДокументов.Дата = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.Ссылка.Дата
	|			И ДатыДокументов.ФизЛицо = СведенияОТрудовомСтажеИЗаработкеСЗВ4РаботникиОрганизации.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФизЛица.ФизЛицо КАК ФизЛицо,
	|	ФизЛица.ФизЛицо.Наименование КАК Наименование,
	|	ФизЛица.ФизЛицо.СтраховойНомерПФР КАК СтраховойНомерПФР,
	|	ФизЛица.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц
	|ПОМЕСТИТЬ ВТФизлицаПоКатегориямЗЛ
	|ИЗ
	|	ВТФизЛица КАК ФизЛица
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИсчисленоПоКатегориямЗЛ.ФизЛицо,
	|	ИсчисленоПоКатегориямЗЛ.ФизЛицо.Наименование,
	|	ИсчисленоПоКатегориямЗЛ.ФизЛицо.СтраховойНомерПФР,
	|	ИсчисленоПоКатегориямЗЛ.КатегорияЗастрахованныхЛиц
	|ИЗ
	|	ВТСуммыВзносов КАК ИсчисленоПоКатегориямЗЛ
	|ГДЕ
	|	(ИсчисленоПоКатегориямЗЛ.НачисленоНакопительная > 0
	|			ИЛИ ИсчисленоПоКатегориямЗЛ.НачисленоСтраховая > 0
	|			ИЛИ ИсчисленоПоКатегориямЗЛ.УплаченоСтраховая > 0
	|			ИЛИ ИсчисленоПоКатегориямЗЛ.УплаченоНакопительная > 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	КатегорияЗастрахованныхЛиц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФизЛица.ФизЛицо КАК ФизЛицо,
	|	ФизЛица.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
	|	ЕСТЬNULL(ФизЛицаСЗВ61.ЛьготыПоУсловиямТруда, ЛОЖЬ) КАК ЛьготыПоУсловиямТруда,
	|	ЕСТЬNULL(ФизЛицаСЗВ61.ЛьготыПоВыслуге, ЛОЖЬ) КАК ЛьготыПоВыслуге,
	|	ФизЛица.Наименование КАК Наименование,
	|	ФизЛица.СтраховойНомерПФР,
	|	ВЫБОР
	|		КОГДА ФизЛица.СтраховойНомерПФР = """"
	|			ТОГДА ИСТИНА
	|		КОГДА ФизЛица.СтраховойНомерПФР = ""   -   -      ""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НетСтраховогоНомера,
	|	ВЫБОР
	|		КОГДА ФизЛицаСЗВ61.ФизЛицо ЕСТЬ НЕ NULL 
	|			ТОГДА ""СЗВ-6-1""
	|		ИНАЧЕ ""СЗВ-6-2""
	|	КОНЕЦ КАК ТипФормДокументов,
	|	ВЫБОР
	|		КОГДА ПереданныеВПФРАдреса.АдресДляИнформирования ЕСТЬ NULL 
	|			ТОГДА "","" + АдресаДляИнформирования.Поле1 + "","" + АдресаДляИнформирования.Поле2 + "","" + АдресаДляИнформирования.Поле3 + "","" + АдресаДляИнформирования.Поле4 + "","" + АдресаДляИнформирования.Поле5 + "","" + АдресаДляИнформирования.Поле6 + "","" + АдресаДляИнформирования.Поле7 + "","" + АдресаДляИнформирования.Поле8 + "","" + АдресаДляИнформирования.Поле9
	|		КОГДА "","" + АдресаДляИнформирования.Поле1 + "","" + АдресаДляИнформирования.Поле2 + "","" + АдресаДляИнформирования.Поле3 + "","" + АдресаДляИнформирования.Поле4 + "","" + АдресаДляИнформирования.Поле5 + "","" + АдресаДляИнформирования.Поле6 + "","" + АдресаДляИнформирования.Поле7 + "","" + АдресаДляИнформирования.Поле8 + "","" + АдресаДляИнформирования.Поле9 <> ПереданныеВПФРАдреса.АдресДляИнформирования
	|			ТОГДА "","" + АдресаДляИнформирования.Поле1 + "","" + АдресаДляИнформирования.Поле2 + "","" + АдресаДляИнформирования.Поле3 + "","" + АдресаДляИнформирования.Поле4 + "","" + АдресаДляИнформирования.Поле5 + "","" + АдресаДляИнформирования.Поле6 + "","" + АдресаДляИнформирования.Поле7 + "","" + АдресаДляИнформирования.Поле8 + "","" + АдресаДляИнформирования.Поле9
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК АдресДляИнформирования,
	|	ЕСТЬNULL(ФИО.Фамилия, """") КАК Фамилия,
	|	ЕСТЬNULL(ФИО.Имя, """") КАК Имя,
	|	ЕСТЬNULL(ФИО.Отчество, """") КАК Отчество,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.НачисленоСтраховая, 0) > 0
	|			ТОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.НачисленоСтраховая, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НачисленоСтраховая,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.НачисленоНакопительная, 0) > 0
	|			ТОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.НачисленоНакопительная, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НачисленоНакопительная,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.УплаченоСтраховая, 0) > 0
	|			ТОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.УплаченоСтраховая, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК УплаченоСтраховая,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.УплаченоНакопительная, 0) > 0
	|			ТОГДА ЕСТЬNULL(ИсчисленоПоЗЛ.УплаченоНакопительная, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК УплаченоНакопительная
	|ИЗ
	|	ВТФизлицаПоКатегориямЗЛ КАК ФизЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизЛицаСЗВ61 КАК ФизЛицаСЗВ61
	|		ПО ФизЛица.ФизЛицо = ФизЛицаСЗВ61.ФизЛицо
	|			И ФизЛица.КатегорияЗастрахованныхЛиц = ФизЛицаСЗВ61.КатегорияЗастрахованныхЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаДляИнформирования
	|		ПО ФизЛица.ФизЛицо = АдресаДляИнформирования.Объект
	|			И (АдресаДляИнформирования.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ИнформАдресФизЛица))
	|			И (АдресаДляИнформирования.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПереданныеВПФРАдреса КАК ПереданныеВПФРАдреса
	|		ПО ФизЛица.ФизЛицо = ПереданныеВПФРАдреса.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИО КАК ФИО
	|		ПО ФизЛица.ФизЛицо = ФИО.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСуммыВзносов КАК ИсчисленоПоЗЛ
	|		ПО ФизЛица.ФизЛицо = ИсчисленоПоЗЛ.ФизЛицо
	|			И ФизЛица.КатегорияЗастрахованныхЛиц = ИсчисленоПоЗЛ.КатегорияЗастрахованныхЛиц
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипФормДокументов,
	|	КатегорияЗастрахованныхЛиц,
	|	ЛьготыПоУсловиямТруда,
	|	ЛьготыПоВыслуге,
	|	Наименование,
	|	ФизЛицо";
	
	РезультатЗапроса = Запрос.Выполнить();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции // ДанныеОСтажеИВзносах()
